Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00/include/pio/pic32ck1025sg00100.h
#define PIN_PC00M_GCLK_IO2                         _UINT32_(64)
#define MUX_PC00M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PC00M_GCLK_IO2                      ((PIN_PC00M_GCLK_IO2 << 16) | MUX_PC00M_GCLK_IO2)
#define PORT_PC00M_GCLK_IO2                        (_UINT32_(1) << 0)

#define PIN_PD12M_GCLK_IO2                         _UINT32_(108)
#define MUX_PD12M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PD12M_GCLK_IO2                      ((PIN_PD12M_GCLK_IO2 << 16) | MUX_PD12M_GCLK_IO2)
#define PORT_PD12M_GCLK_IO2                        (_UINT32_(1) << 12)

#define PIN_PC01M_GCLK_IO3                         _UINT32_(65)
#define MUX_PC01M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PC01M_GCLK_IO3                      ((PIN_PC01M_GCLK_IO3 << 16) | MUX_PC01M_GCLK_IO3)
#define PORT_PC01M_GCLK_IO3                        (_UINT32_(1) << 1)

#define PIN_PD05M_GCLK_IO3                         _UINT32_(101)
#define MUX_PD05M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PD05M_GCLK_IO3                      ((PIN_PD05M_GCLK_IO3 << 16) | MUX_PD05M_GCLK_IO3)
#define PORT_PD05M_GCLK_IO3                        (_UINT32_(1) << 5)

#define PIN_PC02M_GCLK_IO4                         _UINT32_(66)
#define MUX_PC02M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PC02M_GCLK_IO4                      ((PIN_PC02M_GCLK_IO4 << 16) | MUX_PC02M_GCLK_IO4)
#define PORT_PC02M_GCLK_IO4                        (_UINT32_(1) << 2)

#define PIN_PD06M_GCLK_IO4                         _UINT32_(102)
#define MUX_PD06M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PD06M_GCLK_IO4                      ((PIN_PD06M_GCLK_IO4 << 16) | MUX_PD06M_GCLK_IO4)
#define PORT_PD06M_GCLK_IO4                        (_UINT32_(1) << 6)

#define PIN_PC03M_GCLK_IO5                         _UINT32_(67)
#define MUX_PC03M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PC03M_GCLK_IO5                      ((PIN_PC03M_GCLK_IO5 << 16) | MUX_PC03M_GCLK_IO5)
#define PORT_PC03M_GCLK_IO5                        (_UINT32_(1) << 3)

#define PIN_PD07M_GCLK_IO5                         _UINT32_(103)
#define MUX_PD07M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PD07M_GCLK_IO5                      ((PIN_PD07M_GCLK_IO5 << 16) | MUX_PD07M_GCLK_IO5)
#define PORT_PD07M_GCLK_IO5                        (_UINT32_(1) << 7)

#define PIN_PA17M_GCLK_IO6                         _UINT32_(17)
#define MUX_PA17M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PA17M_GCLK_IO6                      ((PIN_PA17M_GCLK_IO6 << 16) | MUX_PA17M_GCLK_IO6)
#define PORT_PA17M_GCLK_IO6                        (_UINT32_(1) << 17)

#define PIN_PC04M_GCLK_IO6                         _UINT32_(68)
#define MUX_PC04M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PC04M_GCLK_IO6                      ((PIN_PC04M_GCLK_IO6 << 16) | MUX_PC04M_GCLK_IO6)
#define PORT_PC04M_GCLK_IO6                        (_UINT32_(1) << 4)

#define PIN_PC05M_GCLK_IO7                         _UINT32_(69)
#define MUX_PC05M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PC05M_GCLK_IO7                      ((PIN_PC05M_GCLK_IO7 << 16) | MUX_PC05M_GCLK_IO7)
#define PORT_PC05M_GCLK_IO7                        (_UINT32_(1) << 5)

/* ========== PORT definition for PCC peripheral ========== */
#define PIN_PC05K_PCC_CLK                          _UINT32_(69)
#define MUX_PC05K_PCC_CLK                          _UINT32_(10)
#define PINMUX_PC05K_PCC_CLK                       ((PIN_PC05K_PCC_CLK << 16) | MUX_PC05K_PCC_CLK)
#define PORT_PC05K_PCC_CLK                         (_UINT32_(1) << 5)

#define PIN_PC01K_PCC_DATA0                        _UINT32_(65)
#define MUX_PC01K_PCC_DATA0                        _UINT32_(10)
#define PINMUX_PC01K_PCC_DATA0                     ((PIN_PC01K_PCC_DATA0 << 16) | MUX_PC01K_PCC_DATA0)
#define PORT_PC01K_PCC_DATA0                       (_UINT32_(1) << 1)

#define PIN_PC02K_PCC_DATA1                        _UINT32_(66)
#define MUX_PC02K_PCC_DATA1                        _UINT32_(10)
#define PINMUX_PC02K_PCC_DATA1                     ((PIN_PC02K_PCC_DATA1 << 16) | MUX_PC02K_PCC_DATA1)
#define PORT_PC02K_PCC_DATA1                       (_UINT32_(1) << 2)

#define PIN_PC03K_PCC_DATA2                        _UINT32_(67)
#define MUX_PC03K_PCC_DATA2                        _UINT32_(10)
#define PINMUX_PC03K_PCC_DATA2                     ((PIN_PC03K_PCC_DATA2 << 16) | MUX_PC03K_PCC_DATA2)
#define PORT_PC03K_PCC_DATA2                       (_UINT32_(1) << 3)

#define PIN_PB07K_PCC_DATA3                        _UINT32_(39)
#define MUX_PB07K_PCC_DATA3                        _UINT32_(10)
#define PINMUX_PB07K_PCC_DATA3                     ((PIN_PB07K_PCC_DATA3 << 16) | MUX_PB07K_PCC_DATA3)
#define PORT_PB07K_PCC_DATA3                       (_UINT32_(1) << 7)

#define PIN_PB08K_PCC_DATA4                        _UINT32_(40)
#define MUX_PB08K_PCC_DATA4                        _UINT32_(10)
#define PINMUX_PB08K_PCC_DATA4                     ((PIN_PB08K_PCC_DATA4 << 16) | MUX_PB08K_PCC_DATA4)
#define PORT_PB08K_PCC_DATA4                       (_UINT32_(1) << 8)

#define PIN_PB09K_PCC_DATA5                        _UINT32_(41)
#define MUX_PB09K_PCC_DATA5                        _UINT32_(10)
#define PINMUX_PB09K_PCC_DATA5                     ((PIN_PB09K_PCC_DATA5 << 16) | MUX_PB09K_PCC_DATA5)
#define PORT_PB09K_PCC_DATA5                       (_UINT32_(1) << 9)

#define PIN_PB10K_PCC_DATA6                        _UINT32_(42)
#define MUX_PB10K_PCC_DATA6                        _UINT32_(10)
#define PINMUX_PB10K_PCC_DATA6                     ((PIN_PB10K_PCC_DATA6 << 16) | MUX_PB10K_PCC_DATA6)
#define PORT_PB10K_PCC_DATA6                       (_UINT32_(1) << 10)

#define PIN_PC00K_PCC_DATA7                        _UINT32_(64)
#define MUX_PC00K_PCC_DATA7                        _UINT32_(10)
#define PINMUX_PC00K_PCC_DATA7                     ((PIN_PC00K_PCC_DATA7 << 16) | MUX_PC00K_PCC_DATA7)
#define PORT_PC00K_PCC_DATA7                       (_UINT32_(1) << 0)

#define PIN_PC15K_PCC_DATA8                        _UINT32_(79)
#define MUX_PC15K_PCC_DATA8                        _UINT32_(10)
#define PINMUX_PC15K_PCC_DATA8                     ((PIN_PC15K_PCC_DATA8 << 16) | MUX_PC15K_PCC_DATA8)
#define PORT_PC15K_PCC_DATA8                       (_UINT32_(1) << 15)

#define PIN_PC16K_PCC_DATA9                        _UINT32_(80)
#define MUX_PC16K_PCC_DATA9                        _UINT32_(10)
#define PINMUX_PC16K_PCC_DATA9                     ((PIN_PC16K_PCC_DATA9 << 16) | MUX_PC16K_PCC_DATA9)
#define PORT_PC16K_PCC_DATA9                       (_UINT32_(1) << 16)

#define PIN_PC17K_PCC_DATA10                       _UINT32_(81)
#define MUX_PC17K_PCC_DATA10                       _UINT32_(10)
#define PINMUX_PC17K_PCC_DATA10                    ((PIN_PC17K_PCC_DATA10 << 16) | MUX_PC17K_PCC_DATA10)
#define PORT_PC17K_PCC_DATA10                      (_UINT32_(1) << 17)

#define PIN_PC18K_PCC_DATA11                       _UINT32_(82)
#define MUX_PC18K_PCC_DATA11                       _UINT32_(10)
#define PINMUX_PC18K_PCC_DATA11                    ((PIN_PC18K_PCC_DATA11 << 16) | MUX_PC18K_PCC_DATA11)
#define PORT_PC18K_PCC_DATA11                      (_UINT32_(1) << 18)

#define PIN_PC19K_PCC_DATA12                       _UINT32_(83)
#define MUX_PC19K_PCC_DATA12                       _UINT32_(10)
#define PINMUX_PC19K_PCC_DATA12                    ((PIN_PC19K_PCC_DATA12 << 16) | MUX_PC19K_PCC_DATA12)
#define PORT_PC19K_PCC_DATA12                      (_UINT32_(1) << 19)

#define PIN_PC20K_PCC_DATA13                       _UINT32_(84)
#define MUX_PC20K_PCC_DATA13                       _UINT32_(10)
#define PINMUX_PC20K_PCC_DATA13                    ((PIN_PC20K_PCC_DATA13 << 16) | MUX_PC20K_PCC_DATA13)
#define PORT_PC20K_PCC_DATA13                      (_UINT32_(1) << 20)

