Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00/include/pio/pic32ck1025sg00100.h
#define PIN_PA09D_SERCOM6_PAD3                     _UINT32_(9) 
#define MUX_PA09D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PA09D_SERCOM6_PAD3                  ((PIN_PA09D_SERCOM6_PAD3 << 16) | MUX_PA09D_SERCOM6_PAD3)
#define PORT_PA09D_SERCOM6_PAD3                    (_UINT32_(1) << 9)

#define PIN_PA10C_SERCOM6_PAD3                     _UINT32_(10)
#define MUX_PA10C_SERCOM6_PAD3                     _UINT32_(2) 
#define PINMUX_PA10C_SERCOM6_PAD3                  ((PIN_PA10C_SERCOM6_PAD3 << 16) | MUX_PA10C_SERCOM6_PAD3)
#define PORT_PA10C_SERCOM6_PAD3                    (_UINT32_(1) << 10)

/* ========== PORT definition for SERCOM7 peripheral ========== */
#define PIN_PA12D_SERCOM7_PAD0                     _UINT32_(12)
#define MUX_PA12D_SERCOM7_PAD0                     _UINT32_(3) 
#define PINMUX_PA12D_SERCOM7_PAD0                  ((PIN_PA12D_SERCOM7_PAD0 << 16) | MUX_PA12D_SERCOM7_PAD0)
#define PORT_PA12D_SERCOM7_PAD0                    (_UINT32_(1) << 12)

#define PIN_PA01C_SERCOM7_PAD0                     _UINT32_(1) 
#define MUX_PA01C_SERCOM7_PAD0                     _UINT32_(2) 
#define PINMUX_PA01C_SERCOM7_PAD0                  ((PIN_PA01C_SERCOM7_PAD0 << 16) | MUX_PA01C_SERCOM7_PAD0)
#define PORT_PA01C_SERCOM7_PAD0                    (_UINT32_(1) << 1)

#define PIN_PA11D_SERCOM7_PAD1                     _UINT32_(11)
#define MUX_PA11D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PA11D_SERCOM7_PAD1                  ((PIN_PA11D_SERCOM7_PAD1 << 16) | MUX_PA11D_SERCOM7_PAD1)
#define PORT_PA11D_SERCOM7_PAD1                    (_UINT32_(1) << 11)

#define PIN_PB12D_SERCOM7_PAD1                     _UINT32_(44)
#define MUX_PB12D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PB12D_SERCOM7_PAD1                  ((PIN_PB12D_SERCOM7_PAD1 << 16) | MUX_PB12D_SERCOM7_PAD1)
#define PORT_PB12D_SERCOM7_PAD1                    (_UINT32_(1) << 12)

#define PIN_PA04C_SERCOM7_PAD1                     _UINT32_(4) 
#define MUX_PA04C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PA04C_SERCOM7_PAD1                  ((PIN_PA04C_SERCOM7_PAD1 << 16) | MUX_PA04C_SERCOM7_PAD1)
#define PORT_PA04C_SERCOM7_PAD1                    (_UINT32_(1) << 4)

#define PIN_PB00D_SERCOM7_PAD2                     _UINT32_(32)
#define MUX_PB00D_SERCOM7_PAD2                     _UINT32_(3) 
#define PINMUX_PB00D_SERCOM7_PAD2                  ((PIN_PB00D_SERCOM7_PAD2 << 16) | MUX_PB00D_SERCOM7_PAD2)
#define PORT_PB00D_SERCOM7_PAD2                    (_UINT32_(1) << 0)

#define PIN_PA05C_SERCOM7_PAD2                     _UINT32_(5) 
#define MUX_PA05C_SERCOM7_PAD2                     _UINT32_(2) 
#define PINMUX_PA05C_SERCOM7_PAD2                  ((PIN_PA05C_SERCOM7_PAD2 << 16) | MUX_PA05C_SERCOM7_PAD2)
#define PORT_PA05C_SERCOM7_PAD2                    (_UINT32_(1) << 5)

#define PIN_PB01D_SERCOM7_PAD3                     _UINT32_(33)
#define MUX_PB01D_SERCOM7_PAD3                     _UINT32_(3) 
#define PINMUX_PB01D_SERCOM7_PAD3                  ((PIN_PB01D_SERCOM7_PAD3 << 16) | MUX_PB01D_SERCOM7_PAD3)
#define PORT_PB01D_SERCOM7_PAD3                    (_UINT32_(1) << 1)

#define PIN_PA06C_SERCOM7_PAD3                     _UINT32_(6) 
#define MUX_PA06C_SERCOM7_PAD3                     _UINT32_(2) 
#define PINMUX_PA06C_SERCOM7_PAD3                  ((PIN_PA06C_SERCOM7_PAD3 << 16) | MUX_PA06C_SERCOM7_PAD3)
#define PORT_PA06C_SERCOM7_PAD3                    (_UINT32_(1) << 6)

/* ========== PORT definition for SPI_IXS peripheral ========== */
#define PIN_PA09J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define MUX_PA09J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define PINMUX_PA09J_SPI_IXS_FSYNC                 ((PIN_PA09J_SPI_IXS_FSYNC << 16) | MUX_PA09J_SPI_IXS_FSYNC)
#define PORT_PA09J_SPI_IXS_FSYNC                   (_UINT32_(1) << 9)

#define PIN_PD06J_SPI_IXS_FSYNC                    _UINT32_(102)
#define MUX_PD06J_SPI_IXS_FSYNC                    _UINT32_(9) 
#define PINMUX_PD06J_SPI_IXS_FSYNC                 ((PIN_PD06J_SPI_IXS_FSYNC << 16) | MUX_PD06J_SPI_IXS_FSYNC)
#define PORT_PD06J_SPI_IXS_FSYNC                   (_UINT32_(1) << 6)

#define PIN_PA11J_SPI_IXS_SCK                      _UINT32_(11)
#define MUX_PA11J_SPI_IXS_SCK                      _UINT32_(9) 
#define PINMUX_PA11J_SPI_IXS_SCK                   ((PIN_PA11J_SPI_IXS_SCK << 16) | MUX_PA11J_SPI_IXS_SCK)
#define PORT_PA11J_SPI_IXS_SCK                     (_UINT32_(1) << 11)

#define PIN_PD10J_SPI_IXS_SCK                      _UINT32_(106)
#define MUX_PD10J_SPI_IXS_SCK                      _UINT32_(9) 
#define PINMUX_PD10J_SPI_IXS_SCK                   ((PIN_PD10J_SPI_IXS_SCK << 16) | MUX_PD10J_SPI_IXS_SCK)
#define PORT_PD10J_SPI_IXS_SCK                     (_UINT32_(1) << 10)

#define PIN_PA12J_SPI_IXS_SDI                      _UINT32_(12)
#define MUX_PA12J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PA12J_SPI_IXS_SDI                   ((PIN_PA12J_SPI_IXS_SDI << 16) | MUX_PA12J_SPI_IXS_SDI)
#define PORT_PA12J_SPI_IXS_SDI                     (_UINT32_(1) << 12)

#define PIN_PD07J_SPI_IXS_SDI                      _UINT32_(103)
#define MUX_PD07J_SPI_IXS_SDI                      _UINT32_(9) 
#define PINMUX_PD07J_SPI_IXS_SDI                   ((PIN_PD07J_SPI_IXS_SDI << 16) | MUX_PD07J_SPI_IXS_SDI)
#define PORT_PD07J_SPI_IXS_SDI                     (_UINT32_(1) << 7)

#define PIN_PB00J_SPI_IXS_SDO                      _UINT32_(32)
#define MUX_PB00J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PB00J_SPI_IXS_SDO                   ((PIN_PB00J_SPI_IXS_SDO << 16) | MUX_PB00J_SPI_IXS_SDO)
#define PORT_PB00J_SPI_IXS_SDO                     (_UINT32_(1) << 0)

#define PIN_PD08J_SPI_IXS_SDO                      _UINT32_(104)
#define MUX_PD08J_SPI_IXS_SDO                      _UINT32_(9) 
#define PINMUX_PD08J_SPI_IXS_SDO                   ((PIN_PD08J_SPI_IXS_SDO << 16) | MUX_PD08J_SPI_IXS_SDO)
#define PORT_PD08J_SPI_IXS_SDO                     (_UINT32_(1) << 8)

/* ========== PORT definition for SQI peripheral ========== */
#define PIN_PD10H_SQI_CLK                          _UINT32_(106)
#define MUX_PD10H_SQI_CLK                          _UINT32_(7) 
#define PINMUX_PD10H_SQI_CLK                       ((PIN_PD10H_SQI_CLK << 16) | MUX_PD10H_SQI_CLK)
#define PORT_PD10H_SQI_CLK                         (_UINT32_(1) << 10)

